L1amaGod/gl-esp-thread-br/examples/gl_s20_thread_border_router/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_BR_BOARD_DEV_KIT=y
CONFIG_PIN_TO_RCP_RESET=2
CONFIG_PIN_TO_RCP_BOOT=3
CONFIG_PIN_TO_RCP_TX=8
CONFIG_PIN_TO_RCP_RX=48
CONFIG_OPENTHREAD_BR_AUTO_START=y
CONFIG_OPENTHREAD_BR_START_WEB=y
CONFIG_EXTERNAL_COEX_REQUEST_PIN=40
CONFIG_EXTERNAL_COEX_GRANT_PIN=42
CONFIG_EXTERNAL_COEX_PRIORITY_PIN=41
CONFIG_EXTERNAL_COEX_TX_LINE_PIN=45
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_EXAMPLE_CONNECT_ETHERNET=y
CONFIG_EXAMPLE_USE_DM9051=y
CONFIG_EXAMPLE_ETH_SPI_SCLK_GPIO=12
CONFIG_EXAMPLE_ETH_SPI_MOSI_GPIO=11
CONFIG_EXAMPLE_ETH_SPI_MISO_GPIO=13
CONFIG_EXAMPLE_ETH_SPI_CS_GPIO=10
CONFIG_EXAMPLE_ETH_SPI_CLOCK_MHZ=20
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_COEX_EXTERNAL_COEXIST_ENABLE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_ECJPAKE_C=y
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_COMM_MAX_JOINER_ENTRIES=50
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_PLATFORM_MSGPOOL_MANAGEMENT=y
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=2048
CONFIG_OPENTHREAD_MLE_MAX_CHILDREN=32
CONFIG_OPENTHREAD_LINK_METRICS=y
CONFIG_OPENTHREAD_DUA_ENABLE=y
CONFIG_OPENTHREAD_CLI_OTA=y
